app/controllers/employers_controller.rb

  def create
    user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]