app/controllers/employers_controller.rb

  def index
    render json Employer.all
---
SELECT "employers".* FROM "employers"

  def create
    user = User.find(session[:user_id])
    employer = user.employers.create!(employer_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "employers" ("user_id", "name", "location", "role", "time_employed", "desc_1", "desc_2", "desc_3", "desc_4", "desc_5", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"