app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC
---
  def index
    render json: Project.all.order(created_at: :asc)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "projects" ("user_id", "name", "desc", "frameworks", "website", "created_at", "updated_at", "github") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    user = User.find(session[:user_id])
    project = user.projects.create!(project_params)

UPDATE "projects" SET "desc" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["desc", "This is another description of project 1"], ["updated_at", "2023-02-15 21:12:21.111820"], ["id", 2]]
---
  def update
    @project.update!(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]
---
  def destroy
    @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_project
    @project = Project.find(params[:id])