app/controllers/projects_controller.rb

  def index
    render json: Project.all
---
SELECT "projects".* FROM "projects"